const ERRORS = {
  1001: '用户名或密码必填！',
  1002: '该用户名已存在，请更名！',
  1003: '用户名或密码错误！',
  1004: '用户名或密码格式不正确！',
  1005: '用户被禁用，请联系管理员',
  1006: '用户待修改信息不完整',
  2001: '类型信息不完整',
  2002: '同名类型已存在，请更名！',
  3001: '图片上传失败，请检查上传的文件是否正常！',
  3002: '图片查询条件确实，请检查',
  4001: '商品信息不完整，请检查！',
  4002: '商品查询条件缺失，请检查',
  4003: '商品信息为空',
  4004: '请求参数不正确！',
  1099: '数据操作失败, 请联系管理员！',
  1000: '身份认证失败，请先登录！'
}

let getErrorInfo = (code, message, err) => {
  console.log('code, err: ', code, err);
  return {
    code: code,
    error: (message || '') + ERRORS[code]
  }
}

module.exports = {
  getErrorInfo
}